def area(a, b): 
    """
    Функция для вычесления площади прямоугольника по его сторонам.
    
        Параметры:
                a: первая сторона прямоугольника
                b: вторая (смежная с первой) сторона пряямоугольника

        Возвращаемое значение:
                S: площадь прямоугольник по формуле a * b

    """
    return a * b 

def perimeter(a, b): 
    """
    Функция для вычесления периметра прямоугольника по его сторонам.
    
        Параметры:
                a: первая сторона прямоугольника
                b: вторая (смежная с первой) сторона пряямоугольника

        Возвращаемое значение:
                S: площадь прямоугольник по формуле 2 * a + 2 * b

    """
    return 2 * a + 2 * b 
