def area(a):
    """
    Функция для вычесления площади квадрата по его стороне.
    
        Параметры:
                a: сторона квадрата

        Возвращаемое значение:
                S: площадь квадрата по формуле a * a

    """
    return a * a


def perimeter(a):
    """
    Функция для вычесления периметра квадрата по его стороне.
    
        Параметры:
                a: сторона квадрата

        Возвращаемое значение:
                S: периметр квадрата по формуле 4 * a

    """
    return 4 * a
