def area(a, h): 
    """
    Функция для вычесления площади треугольника по его высоте и стороне к которой она проведена.
    
        Параметры:
                a: сторона квадрата
                h: высота которая проведена к этой стороне

        Возвращаемое значение:
                S: площадь треугольника по формуле a * h / 2

    """
    return a * h / 2 


def perimeter(a, b, c):
    """
    Функция для вычесления периметра треугольника по его сторонам.
    
        Параметры:
                a: первая сторона квадрата
                b: вторая сторона квадрата
                c: третья сторона квадрата
                

        Возвращаемое значение:
                S: площадь треугольника по формуле a + b + c

    """
    return a + b + c 
